## Staging: system_status_static_site
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 0 to change, 4 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                                  NAME                                                                   |
|----------|-----------------------------------------------------------------------------------------------------------------------------------------|
| recreate | `module.system_status_static_site.aws_acm_certificate_validation.cloudfront[0]`                                                         |
|          | `module.system_status_static_site.aws_route53_record.cloudfront_alias`                                                                  |
|          | `module.system_status_static_site.aws_route53_record.cloudfront_certificate_validation[&quot;*.status.staging.notification.cdssandbox.xyz&quot;]` |
|          | `module.system_status_static_site.aws_route53_record.cloudfront_certificate_validation[&quot;status.staging.notification.cdssandbox.xyz&quot;]`   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.system_status_static_site.aws_acm_certificate_validation.cloudfront[0] must be replaced
-/+ resource "aws_acm_certificate_validation" "cloudfront" {
      ~ id                      = "2024-06-19 18:20:40.615 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [ # forces replacement
          - "_440d029c47fc1dfe910ea2610b495f24.status.staging.notification.cdssandbox.xyz",
        ] -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.system_status_static_site.aws_route53_record.cloudfront_alias must be replaced
-/+ resource "aws_route53_record" "cloudfront_alias" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "status.staging.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z_status.staging.notification.cdssandbox.xyz_A" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "status.staging.notification.cdssandbox.xyz"
      - records                          = [] -> null
      - ttl                              = 0 -> null
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "ZQSVJUPU6J1EY" # forces replacement
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.system_status_static_site.aws_route53_record.cloudfront_certificate_validation["*.status.staging.notification.cdssandbox.xyz"] must be replaced
-/+ resource "aws_route53_record" "cloudfront_certificate_validation" {
      ~ fqdn                             = "_440d029c47fc1dfe910ea2610b495f24.status.staging.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z__440d029c47fc1dfe910ea2610b495f24.status.staging.notification.cdssandbox.xyz._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "_440d029c47fc1dfe910ea2610b495f24.status.staging.notification.cdssandbox.xyz"
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "ZQSVJUPU6J1EY" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.system_status_static_site.aws_route53_record.cloudfront_certificate_validation["status.staging.notification.cdssandbox.xyz"] must be replaced
-/+ resource "aws_route53_record" "cloudfront_certificate_validation" {
      ~ fqdn                             = "_440d029c47fc1dfe910ea2610b495f24.status.staging.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z__440d029c47fc1dfe910ea2610b495f24.status.staging.notification.cdssandbox.xyz._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "_440d029c47fc1dfe910ea2610b495f24.status.staging.notification.cdssandbox.xyz"
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "ZQSVJUPU6J1EY" # forces replacement
        # (4 unchanged attributes hidden)
    }

Plan: 4 to add, 0 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

